# 描述:算数运算符
x = 100
y = 200
# 变量名 = 变量值
z = x + y
print(z)                  # 300
print(x, y, z)            # 100  200  300
print(x, '+', y, '=', z)  # 100 + 200 = 300

print('-------------------------------------')
z1 = x - y
print(z1)
print(x, '-', y, '=', z1)

print('-------------------------------------')
z2 = x * y    # 100 * 200
z3 = x / y    # 100 / 200
z4 = y / x    # 200 / 100     # 重点
print(z2)
print(z3)
print(z4)     # 2.0
print('-------------------------------------')

a = 2
b = 10
c = 4

# ** 表示乘方
s1 = a ** 10    # 1024
print(s1)

s2 = b / a
print(s2)

# //  表示整除
s3 = b // a
print(s3)
s4 = b // c    # 2.5       重点
print(s4)

# % 表示取余
s5 = b % c     # 10 % 4
print(s5)      # 2

s6 = c % b     # 4 % 10    重点
print(s6)      # 4













